tmp/war/WEB-INF/saved_forms/anna.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Body>
    <n1:DiscountServiceRequest xmlns:n1="http://schemas.gid.gap.com/discountService/v1">
      <RequestDateTime xsi:nil="true"></RequestDateTime>
      <StoreID xsi:nil="true"></StoreID>
      <RequestType>LIVE</RequestType>
      <orderRequest>
        <OrderID>1234</OrderID>
        <OrderDate>05/07/2009 15:44</OrderDate>
        <Channel>POS</Channel>
        <Brand>Gap</Brand>
        <Market>CANADA</Market>
        <OrderLineItems>
          <SequenceNumber>0</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>3127827112</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>8</ItemCompanyNumber>
            <ItemDivisionNumber>83</ItemDivisionNumber>
            <ItemDepartmentNumber>832</ItemDepartmentNumber>
            <ItemClassNumber>03</ItemClassNumber>
            <ItemSubClassNumber>01</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>59.99</NetPrice>
            <PriceType>REGULAR</PriceType>
          </Price>
          <Quantity>1</Quantity>
        </OrderLineItems>
        <OrderLineItems>
          <SequenceNumber>1</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>3127494530</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>8</ItemCompanyNumber>
            <ItemDivisionNumber>81</ItemDivisionNumber>
            <ItemDepartmentNumber>819</ItemDepartmentNumber>
            <ItemClassNumber>04</ItemClassNumber>
            <ItemSubClassNumber>00</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>25</NetPrice>
            <PriceType>REGULAR</PriceType>
          </Price>
          <Quantity>1</Quantity>
        </OrderLineItems>
        <OrderLineItems>
          <SequenceNumber>2</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>3127490012</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>8</ItemCompanyNumber>
            <ItemDivisionNumber>84</ItemDivisionNumber>
            <ItemDepartmentNumber>846</ItemDepartmentNumber>
            <ItemClassNumber>00</ItemClassNumber>
            <ItemSubClassNumber>00</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>65</NetPrice>
            <PriceType>REGULAR</PriceType>
          </Price>
          <Quantity>1</Quantity>
        </OrderLineItems>
        <OrderLineItems>
          <SequenceNumber>3</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>3127492212</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>8</ItemCompanyNumber>
            <ItemDivisionNumber>83</ItemDivisionNumber>
            <ItemDepartmentNumber>832</ItemDepartmentNumber>
            <ItemClassNumber>12</ItemClassNumber>
            <ItemSubClassNumber>00</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>29.99</NetPrice>
            <PriceType>REGULAR</PriceType>
          </Price>
          <Quantity>1</Quantity>
        </OrderLineItems>
        <OrderLineItems>
          <SequenceNumber>4</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>3127494530</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>8</ItemCompanyNumber>
            <ItemDivisionNumber>81</ItemDivisionNumber>
            <ItemDepartmentNumber>819</ItemDepartmentNumber>
            <ItemClassNumber>02</ItemClassNumber>
            <ItemSubClassNumber>04</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>29.99</NetPrice>
            <PriceType>REGULAR</PriceType>
          </Price>
          <Quantity>1</Quantity>
        </OrderLineItems>
        <Promotions>
          <SequenceNumber>0</SequenceNumber>
          <PromotionCode>10P50GLIX4</PromotionCode>
          <ReceiptMessages></ReceiptMessages>
          <PromoUsages></PromoUsages>
          <QualifyingTenders xsi:nil="true"></QualifyingTenders>
        </Promotions>
      </orderRequest>
    </n1:DiscountServiceRequest>
  </env:Body>
</env:Envelope>